function hn=rootRaisedCosine(N,a,Ts,Tc)
% ------------------------------------
% 频率抽样法设计平方根升余弦滤波器
% N为滤波器阶数
% a为滚降系数，0<a≤1
% Ts为滤波器数字化时的抽样周期
% Tc为表征升余弦滤波器的频率响应的常数
% ------------------------------------
n=0:1:N-1;
%这里为抽样后模拟频率f与n的关系
f=n/(N*Ts);
%此为群延时系数
tau=(N-1)/2;
%理想的平方根升余弦滚降滤波器表达式
Hd=Tc*(f<=(1-a)/(2*Tc))+(Tc/2)*(1+cos((pi*Tc/a)*(abs(f)-(1-a)/(2*Tc)))).*(f>(1-a)/(2*Tc)&f<=(1+a)/(2*Tc));
%数字化后频域的周期延拓，这里轴对称时要注意Matlab数组下标从1开始
Hd=[Hd,0]+[0,Hd(N-n)];
Hd(N+1)=[];
%赋予相位
Phi=(-(2*pi*n/N)*tau).*(n>=0&n<=tau)+((2*pi*(N-n)/N)*tau).*(n>=tau+1&n<=N-1);
Hn=sqrt(abs(Hd)).*exp(1i*Phi);
%IDFT得到冲激响应序列
hn=ifft(Hn,N);
end